Tekla Open API Reference for Tekla Structures 2025
Identifier.GUID Property
 The object's globally unique identifier. If the GUID value is set manually, the ID is initialized to 0 and the identification is done based on the GUID.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Guid GUID { get; set; }
Public Property GUID As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Identifier Class
Tekla.Structures Namespace